{
  "backend/main.mo": "Main actor defining user profiles, client data models, authorization checks, and related helpers for progress, subscriptions, follow‑ups, and onboarding.",
  "backend/migration.mo": "Migration module converting old client records to the new format by adding owner and initialPlanDetails fields.",
  "feature_evidence.json": "Feature evidence report listing added or updated frontend files related to plan subscriptions and UI updates for onboarding and client views.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and updates of various frontend files across the app.",
  "frontend/index.css": "Global Tailwind CSS variables and theme definitions for light and dark modes with OKLCH color tokens.",
  "frontend/index.html": "Base HTML template loading the app root and SheetJS for Excel export.",
  "frontend/src/App.tsx": "Main app component managing authentication, actor connection, profile setup, routing, and lazy-loaded pages.",
  "frontend/src/components/auth/LoginGate.tsx": "Login screen providing Internet Identity authentication with styled UI and feature highlights.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "A form dialog for entering and saving a user's name during profile setup, with validation and loading states.",
  "frontend/src/components/clients/ActionHint.tsx": "Displays a tooltip message with an optional icon for contextual hints.",
  "frontend/src/components/clients/ActivateClientDialog.tsx": "Dialog for selecting a client's plan start date and follow‑up day before activation, with validation handling.",
  "frontend/src/components/clients/ClientPrimaryActionsCard.tsx": "Shows primary client management actions such as activate, pause, resume, renew, expire, and convert to full onboarding.",
  "frontend/src/components/clients/ClientsStatusFilterButton.tsx": "Dropdown button for filtering clients by status, showing counts and the currently selected filter.",
  "frontend/src/components/clients/ClientStatusBadge.tsx": "Renders a badge representing a client’s current status including onboarding, active, paused, and expired states.",
  "frontend/src/components/clients/ConvertToFullOnboardingButton.tsx": "Button to convert a client to full onboarding, with loading, disabled, and hint states.",
  "frontend/src/components/clients/ExportClientsExcelDialog.tsx": "Dialog for exporting client data to Excel, supporting full or custom field selection with validation.",
  "frontend/src/components/clients/FollowUpPromptDialog.tsx": "Dialog for marking follow-ups done or not, validating notes in manual mode, and submitting the result with optional loading state.",
  "frontend/src/components/clients/FollowUpSection.tsx": "Displays follow-up status, history, and a button to manually mark a follow-up as done, using client data and utility formatters.",
  "frontend/src/components/clients/PauseClientDialog.tsx": "Dialog that validates and submits pause duration and reason for pausing a client's plan, resetting state on close.",
  "frontend/src/components/clients/RenewSubscriptionDialog.tsx": "Dialog for renewing a subscription by selecting months, extra days, and a start date, validating inputs before confirming.",
  "frontend/src/components/clients/SubscriptionsSection.tsx": "Renders a table of client subscriptions with status badges, sorted by start date, showing duration and active state.",
  "frontend/src/components/dashboard/ActiveClientsDialog.tsx": "Wraps ClientsMetricDialog to display active clients with predefined title, description, and settings.",
  "frontend/src/components/dashboard/ClientsMetricDialog.tsx": "Dialog component that lists client metrics with export and view actions, supporting optional columns based on props.",
  "frontend/src/components/dashboard/ExpiringSoonClientsDialog.tsx": "Wrapper around ClientsMetricDialog configured to show clients with plans expiring within 10 days.",
  "frontend/src/components/dashboard/OnboardingClientsDialog.tsx": "Dialog showing half and full onboarding clients with actions to view, export, and convert to full onboarding.",
  "frontend/src/components/dashboard/PausedClientsDialog.tsx": "Wrapper around ClientsMetricDialog for displaying clients who have paused their training.",
  "frontend/src/components/dashboard/RenewalOpportunitiesThisMonthDialog.tsx": "Dialog listing clients with plans expiring this month, including export and view functionality.",
  "frontend/src/components/dashboard/TotalClientsDialog.tsx": "Wrapper around ClientsMetricDialog that displays all active clients.",
  "frontend/src/components/debug/InitialLoadDebugPanel.tsx": "Debug panel showing initial load timing events with live updates and visibility toggle.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with navigation, user menu, theming options, and logout handling.",
  "frontend/src/components/layout/RouteLoadingFallback.tsx": "Simple loading fallback component for route transitions.",
  "frontend/src/components/onboarding/OnboardingStatusHelp.tsx": "Static help component explaining onboarding states and activation requirements.",
  "frontend/src/components/onboarding/OnboardingWizard.tsx": "Multi-step onboarding wizard UI with step indicators, scrollable content, and next/back/submit controls.",
  "frontend/src/components/onboarding/PlanSubscriptionSection.tsx": "Form section for entering plan duration, unit, and extra days with validation and helper text.",
  "frontend/src/components/progress/ProgressCharts.tsx": "Displays weight and measurement history using Recharts line charts, with sorted data and formatted dates.",
  "frontend/src/components/progress/ProgressEntryForm.tsx": "Form for submitting new progress measurements, performing validation, mutation, and resetting fields on success.",
  "frontend/src/components/progress/ProgressHistoryTable.tsx": "Renders a sortable progress history table with trends and formatted values for each measurement.",
  "frontend/src/components/theme/ThemeToggleMenu.tsx": "Dropdown menu items for switching between light, dark, and system themes.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useActorReady.ts": "Hook wrapping useActor to provide a delayed ready signal for safer query mounting during actor transitions.",
  "frontend/src/hooks/useBackendReadiness.ts": "Polls backend readiness with exponential backoff, resetting state when the actor changes and exposing isChecking and isReady flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling AuthClient creation, login, logout, and identity persistence with status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for fetching and mutating backend data, scoped by identity and gated on backend readiness.",
  "frontend/src/hooks/useRouter.ts": "Implements hash-based routing with helpers for navigation and extracting a client code.",
  "frontend/src/hooks/useStableActorConnection.ts": "Wraps backend readiness into a stabilized connection state with brief delay to avoid UI flicker.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark themes, color tokens, and typography.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/ClientProfilePage.tsx": "Client profile page showing client details, progress, actions, dialogs, and subscription management driven by query hooks.",
  "frontend/src/pages/ClientsListPage.tsx": "Displays a searchable and filterable list of clients, including status filtering and an export-to-Excel dialog.",
  "frontend/src/pages/DashboardPage.tsx": "Computes and displays client metrics with dialogs for detailed lists of totals, onboarding, paused, expiring, and renewal opportunities.",
  "frontend/src/pages/OnboardClientPage.tsx": "Implements a multi-step wizard for creating a new client with validation, plan details, onboarding state, and final submission.",
  "frontend/src/utils/clientCode.ts": "Provides helpers to format client codes and match them against normalized search queries.",
  "frontend/src/utils/clientExportFields.ts": "Defines exportable client fields with accessors for Excel generation, including plan, status, and subscription metadata.",
  "frontend/src/utils/errors.ts": "Normalizes backend errors into concise, user-friendly messages.",
  "frontend/src/utils/excelExport.ts": "Builds and downloads an Excel file from client data using SheetJS with auto-sized columns.",
  "frontend/src/utils/followUp.ts": "Calculates follow-up due status, latest entries, and date matching logic for client follow-up tracking.",
  "frontend/src/utils/format.ts": "Provides helpers to format bigint timestamps into date, datetime, and Excel-friendly strings.",
  "frontend/src/utils/initialLoadTimings.ts": "Implements a debug-gated timing utility to record, end, and report initial load performance events.",
  "frontend/src/utils/mobileNumber.ts": "Offers functions to normalize, validate, and return error messages for mobile numbers.",
  "frontend/src/utils/plan.ts": "Calculates total plan days, computes plan end dates, and formats dates for input fields.",
  "frontend/src/utils/renewalOpportunities.ts": "Determines current-month boundaries and filters or counts clients with subscription end dates within the month.",
  "frontend/src/utils/status.ts": "Defines client status logic, including activation, expiration, display status, and computes summary metrics.",
  "frontend/src/utils/urlParams.ts": "Handles URL parameter extraction, session persistence, and cleanup for query and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme settings, colors, animations, and loading plugins.",
  "project_state.json": "Describes project state, issues, and feature requests related to onboarding plan details and user data isolation."
}