{
  "backend/main.mo": "Backend actor defining user profiles, authorization checks, and comprehensive client management types including progress, follow-ups, pauses, and subscriptions.",
  "feature_evidence.json": "Feature evidence report mapping frontend files to features, components, and test IDs with high-confidence annotations.",
  "frontend-file-summaries.txt": "Plain text map of frontend file paths to short descriptions of their roles and behaviors.",
  "frontend/index.css": "Tailwind base styles defining light and dark theme color tokens and global layout variables.",
  "frontend/index.html": "HTML entry file loading the React app root and SheetJS for Excel export.",
  "frontend/src/App.tsx": "Main app component handling authentication, initial data loading, error states, routing, and layout with lazy-loaded pages.",
  "frontend/src/components/auth/LoginGate.tsx": "Login screen using Internet Identity with a branded UI and secure authentication messaging.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new users to save their profile name with validation and mutation handling.",
  "frontend/src/components/clients/ActivateClientDialog.tsx": "Dialog for activating a client plan, allowing selection of start date and follow-up day with validation before confirming.",
  "frontend/src/components/clients/ClientsStatusFilterButton.tsx": "Filter dropdown button for selecting client status categories, showing counts and updating the current filter.",
  "frontend/src/components/clients/ClientStatusBadge.tsx": "Displays a status badge for a client based on their display status, with variants for active, paused, expired, onboarding, and others.",
  "frontend/src/components/clients/ExportClientsExcelDialog.tsx": "Dialog for exporting clients to Excel, supporting all-fields or select-fields modes with validation and filename generation.",
  "frontend/src/components/clients/FollowUpPromptDialog.tsx": "Dialog prompting follow-up completion with optional or required notes depending on mode, submitting status and notes.",
  "frontend/src/components/clients/FollowUpSection.tsx": "Displays a client's follow‑up status, history table, and an optional button to mark follow‑up as done.",
  "frontend/src/components/clients/PauseClientDialog.tsx": "Dialog for pausing a client plan, collecting pause duration and reason with validation before confirming.",
  "frontend/src/components/clients/RenewSubscriptionDialog.tsx": "Dialog for renewing a subscription, handling month selection, extra days, start date validation, and confirmation.",
  "frontend/src/components/clients/SubscriptionsSection.tsx": "Displays a table of subscriptions sorted by start date, highlighting current and past plans.",
  "frontend/src/components/dashboard/ActiveClientsDialog.tsx": "Wraps ClientsMetricDialog to show currently active clients with plan end dates.",
  "frontend/src/components/dashboard/ClientsMetricDialog.tsx": "Generic dialog listing clients with export support, navigation, and configurable columns.",
  "frontend/src/components/dashboard/ExpiringSoonClientsDialog.tsx": "Wraps ClientsMetricDialog to show clients whose plans expire within 10 days.",
  "frontend/src/components/dashboard/OnboardingClientsDialog.tsx": "Wraps ClientsMetricDialog to show clients pending onboarding with onboarding status.",
  "frontend/src/components/dashboard/PausedClientsDialog.tsx": "Wraps ClientsMetricDialog to show clients who have paused their training.",
  "frontend/src/components/dashboard/RenewalOpportunitiesThisMonthDialog.tsx": "Dialog listing clients with plans expiring this month and offering export and navigation.",
  "frontend/src/components/dashboard/TotalClientsDialog.tsx": "Wraps ClientsMetricDialog to display all active clients without plan end dates.",
  "frontend/src/components/debug/InitialLoadDebugPanel.tsx": "Debug panel showing initial load performance events and total duration, updated in real time.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component providing header, navigation, and user menu with logout and route handling.",
  "frontend/src/components/layout/RouteLoadingFallback.tsx": "Simple loading screen with spinner for route transitions.",
  "frontend/src/components/progress/ProgressCharts.tsx": "Renders weight and body measurement line charts from client progress data using Recharts.",
  "frontend/src/components/progress/ProgressEntryForm.tsx": "Form for entering client progress measurements and submitting them via mutation.",
  "frontend/src/components/progress/ProgressHistoryTable.tsx": "Table listing historical progress entries with trends and formatted values.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on Internet Identity, invalidating queries when it changes.",
  "frontend/src/hooks/useActorReady.ts": "Hook providing a delayed 'actorReady' signal to avoid race conditions during actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login, logout, and persisted identity handling.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating backend data, including app initialization, user profile, and client summaries. Seeds caches and manages query keys scoped by identity.",
  "frontend/src/hooks/useRouter.ts": "Hash-based router hook that tracks the current route, updates on hash changes, and extracts a client code from the route.",
  "frontend/src/hooks/useStableActorConnection.ts": "Stabilizes actor connection state with a brief delay to prevent UI flicker when the backend actor becomes ready.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme CSS variables and base styles for the app.",
  "frontend/src/main.tsx": "App entry point that mounts React, sets up the QueryClientProvider, and wraps the app in the InternetIdentityProvider.",
  "frontend/src/pages/ClientProfilePage.tsx": "Client detail page showing profile, status actions, progress history, and subscription management with several dialogs and lazy‑loaded components.",
  "frontend/src/pages/ClientsListPage.tsx": "Client list page supporting filtering, searching, status categorization, and preparing clients for export.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard overview computing metrics for active, paused, expiring, and onboarding clients, with dialogs for detailed lists.",
  "frontend/src/pages/OnboardClientPage.tsx": "Form page for creating a new client with onboarding state, validation, submission, and success screen.",
  "frontend/src/utils/clientCode.ts": "Utility functions for formatting, normalizing, and matching client codes.",
  "frontend/src/utils/clientExportFields.ts": "Defines exportable client fields with accessors for Excel or CSV generation.",
  "frontend/src/utils/errors.ts": "Converts backend errors into simplified, user-friendly messages.",
  "frontend/src/utils/excelExport.ts": "Exports client data to an Excel file using SheetJS, building headers and rows dynamically.",
  "frontend/src/utils/followUp.ts": "Helpers for determining follow‑up due status and retrieving latest follow‑up entries.",
  "frontend/src/utils/format.ts": "Timestamp formatting helpers for date, datetime, and Excel date output.",
  "frontend/src/utils/initialLoadTimings.ts": "Lightweight utility for tracking and reporting initial load performance timings.",
  "frontend/src/utils/plan.ts": "Functions to compute plan durations, end dates, and format dates for input controls.",
  "frontend/src/utils/renewalOpportunities.ts": "Identifies clients with subscription renewals due this month and counts them.",
  "frontend/src/utils/status.ts": "Determines client activation, status, display status, and computes status metrics.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them to sessionStorage, and removing them from hash-based routes.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, animations, container settings, and plugins.",
  "project_state.json": "Defines the project’s state and requirements for stabilizing onboarding and handling backend actor readiness errors."
}