{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles and a comprehensive client management model including progress, follow‑ups, pauses, and subscriptions.",
  "feature_evidence.json": "Feature evidence report mapping dark mode, color palette, typography, and theme‑coherence features to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing UI, hooks, utilities, and page behaviors for build planning.",
  "frontend/index.css": "Global Tailwind base styles defining vivid OKLCH color tokens for light and dark themes and applying them to core UI elements.",
  "frontend/index.html": "Root HTML document bootstrapping the app, loading SheetJS for Excel export, and mounting the React entrypoint.",
  "frontend/src/App.tsx": "Root React component handling auth, backend readiness, theme provider setup, layout, and lazy‑loaded routing for main pages.",
  "frontend/src/components/auth/LoginGate.tsx": "Login screen using Internet Identity with bold visual styling, gradient hero section, and feature highlights.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for creating a user profile by entering a name and submitting via a mutation hook with loading and error handling.",
  "frontend/src/components/clients/ActionHint.tsx": "Tooltip component displaying an inline hint message with an optional icon.",
  "frontend/src/components/clients/ActivateClientDialog.tsx": "Dialog for activating a client by selecting a start date and follow-up day with validation and confirm handling.",
  "frontend/src/components/clients/ClientPrimaryActionsCard.tsx": "UI card presenting primary client actions such as activate, pause/resume, renew, expire, and convert to full onboarding with disabled states.",
  "frontend/src/components/clients/ClientsStatusFilterButton.tsx": "Dropdown filter button allowing selection of client status categories with counts and visual selection indicators.",
  "frontend/src/components/clients/ClientStatusBadge.tsx": "Badge component that displays a client's status with different variants for each status type.",
  "frontend/src/components/clients/ConvertToFullOnboardingButton.tsx": "Button for converting a client to full onboarding, supporting loading, disabled states, and explanatory hints.",
  "frontend/src/components/clients/ExportClientsExcelDialog.tsx": "Dialog for exporting client data to Excel with options to export all fields or select specific ones and handle file generation.",
  "frontend/src/components/clients/FollowUpPromptDialog.tsx": "Modal for marking follow-ups done or not, validating notes in manual mode and submitting results.",
  "frontend/src/components/clients/FollowUpSection.tsx": "Displays a client's follow-up status, history, and provides an optional action to mark follow-up as done.",
  "frontend/src/components/clients/PauseClientDialog.tsx": "Dialog for pausing a client plan with validation for pause duration and required reason.",
  "frontend/src/components/clients/RenewSubscriptionDialog.tsx": "Dialog for renewing a subscription by selecting plan months, extra days, and start date with validation.",
  "frontend/src/components/clients/SubscriptionsSection.tsx": "Shows a sortable list of subscriptions with status indicators and plan duration details.",
  "frontend/src/components/dashboard/ActiveClientsDialog.tsx": "Wrapper dialog displaying currently active clients using a generic metrics dialog component.",
  "frontend/src/components/dashboard/ClientsMetricDialog.tsx": "Reusable dialog showing a list of clients with export and navigation actions, supporting optional plan end date and onboarding state columns.",
  "frontend/src/components/dashboard/ExpiringSoonClientsDialog.tsx": "Wraps ClientsMetricDialog to display clients whose plans expire within 10 days.",
  "frontend/src/components/dashboard/OnboardingClientsDialog.tsx": "Dialog listing onboarding clients with export and conversion actions, plus navigation to client profiles.",
  "frontend/src/components/dashboard/PausedClientsDialog.tsx": "Wraps ClientsMetricDialog to show clients who have paused their training, including plan end dates.",
  "frontend/src/components/dashboard/RenewalOpportunitiesThisMonthDialog.tsx": "Dialog listing clients with plans expiring this month, with export and profile navigation options.",
  "frontend/src/components/dashboard/TotalClientsDialog.tsx": "Wraps ClientsMetricDialog to show all active clients without plan end date info.",
  "frontend/src/components/debug/InitialLoadDebugPanel.tsx": "Floating debug panel displaying initial load timing events with live updates.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with navigation, user menu, theming, and logout handling.",
  "frontend/src/components/layout/RouteLoadingFallback.tsx": "Centered loading spinner used as a fallback during route transitions.",
  "frontend/src/components/onboarding/OnboardingStatusHelp.tsx": "Provides onboarding status descriptions and an alert explaining activation requirements.",
  "frontend/src/components/onboarding/OnboardingWizard.tsx": "Multi-step onboarding wizard component rendering step indicators, content area, and navigation buttons with submit handling.",
  "frontend/src/components/progress/ProgressCharts.tsx": "Displays weight and body measurement line charts using Recharts, with empty-state handling and formatted progress data.",
  "frontend/src/components/progress/ProgressEntryForm.tsx": "Form for recording client progress measurements, validating inputs and submitting via a mutation hook with success/error toasts.",
  "frontend/src/components/progress/ProgressHistoryTable.tsx": "Renders a sortable progress history table showing measurements and weight trends with icons.",
  "frontend/src/components/theme/ThemeToggleMenu.tsx": "Dropdown menu items allowing users to switch between light, dark, and system themes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useActorReady.ts": "Provides an actorReady flag that becomes true shortly after the actor is available to avoid race conditions during invalidation.",
  "frontend/src/hooks/useBackendReadiness.ts": "Polls backend readiness with exponential backoff, resetting when actor changes and exposing readiness state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity state, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as app init info, user profiles, and client summaries, keyed by identity.",
  "frontend/src/hooks/useRouter.ts": "Implements a simple hash-based router with navigation and client code extraction helpers.",
  "frontend/src/hooks/useStableActorConnection.ts": "Tracks stabilized backend readiness state to signal when the actor connection is fully usable.",
  "frontend/src/index.css": "TailwindCSS base and theme variables for light and dark modes, including color tokens and typography styles.",
  "frontend/src/main.tsx": "Bootstraps the React app by setting up QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/ClientProfilePage.tsx": "Page for viewing and managing a single client's profile, activation state, progress, and follow-up actions with multiple dialogs and lazy-loaded charts.",
  "frontend/src/pages/ClientsListPage.tsx": "Displays a filterable and searchable list of client summaries with export functionality and navigation to client profiles.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page that loads client summary data, computes metrics, and shows dialogs for various client categories.",
  "frontend/src/pages/OnboardClientPage.tsx": "Client onboarding wizard handling validation, form steps, and client creation via backend mutation.",
  "frontend/src/utils/clientCode.ts": "Utilities for formatting and matching client codes with zero-padding and normalized search queries.",
  "frontend/src/utils/clientExportFields.ts": "Defines exportable client fields with accessors for use in spreadsheet exports, including status and subscription data.",
  "frontend/src/utils/errors.ts": "Normalizes backend error messages into user-friendly strings with special handling for common cases.",
  "frontend/src/utils/excelExport.ts": "Uses SheetJS to export client data to an Excel file based on provided field definitions.",
  "frontend/src/utils/followUp.ts": "Helpers to determine follow-up due status, latest entries, and day-matching logic for clients.",
  "frontend/src/utils/format.ts": "Date formatting utilities converting bigint timestamps into readable or export-friendly strings.",
  "frontend/src/utils/initialLoadTimings.ts": "Debug-only timing utility to record and report initial load performance events.",
  "frontend/src/utils/mobileNumber.ts": "Mobile number normalization and validation helpers used during client onboarding.",
  "frontend/src/utils/plan.ts": "Provides functions to compute total plan days, calculate a plan end date, and format dates for input fields.",
  "frontend/src/utils/renewalOpportunities.ts": "Computes current month boundaries and filters/counts clients whose active subscriptions end within the month.",
  "frontend/src/utils/status.ts": "Determines client activation and status, computes display status, and aggregates counts of active, paused, and expired clients.",
  "frontend/src/utils/urlParams.ts": "Handles retrieving, storing, and clearing URL and session-stored parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind config extending typography, colors, animations, and layout settings with plugins for dark mode and enhanced UI styling.",
  "project_state.json": "Describes project state and features focused on dark mode, bold theme updates, and UI/typography improvements."
}