{
  "backend/main.mo": "Defines authorization-backed actor with user profiles, client fitness data types, and helpers for sorting and permissions.",
  "feature_evidence.json": "Lists feature evidence records with affected files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files describing their roles in the app.",
  "frontend/index.css": "Global Tailwind base styles defining light/dark theme color tokens and layout defaults.",
  "frontend/index.html": "HTML entrypoint loading root container, Vite script, and SheetJS for Excel export.",
  "frontend/src/App.tsx": "Main app component handling authentication, init-data loading, routing, layouts, and debug panel.",
  "frontend/src/components/auth/LoginGate.tsx": "Login screen using Internet Identity with branding and onboarding feature highlights.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for first‑time users to submit their name and create a profile.",
  "frontend/src/components/clients/ActivateClientDialog.tsx": "Dialog for activating a client plan by selecting a start date and follow-up day with validation before confirming.",
  "frontend/src/components/clients/ClientsStatusFilterButton.tsx": "Dropdown button that lets users filter clients by status and shows counts for each filter option.",
  "frontend/src/components/clients/ClientStatusBadge.tsx": "Renders a status badge for a client based on display status with different visual variants.",
  "frontend/src/components/clients/ExportClientsExcelDialog.tsx": "Dialog for exporting client data to Excel, allowing full export or selecting specific fields.",
  "frontend/src/components/clients/FollowUpPromptDialog.tsx": "Dialog prompting users to mark a follow-up as done or not, with optional or required notes depending on mode.",
  "frontend/src/components/clients/FollowUpSection.tsx": "Displays a client’s follow-up status, history, and a button to manually mark follow-up as done.",
  "frontend/src/components/clients/PauseClientDialog.tsx": "Dialog for pausing a client plan by entering pause duration and reason with validation before confirming.",
  "frontend/src/components/clients/RenewSubscriptionDialog.tsx": "Modal for renewing a client subscription with month selection, extra days, date input, validation, and confirm callback.",
  "frontend/src/components/clients/SubscriptionsSection.tsx": "Displays a table of sorted client subscriptions with status indicators, dates, and duration details.",
  "frontend/src/components/dashboard/RenewalOpportunitiesThisMonthDialog.tsx": "Dialog listing clients whose plans expire this month, with export functionality and navigation to client details.",
  "frontend/src/components/debug/InitialLoadDebugPanel.tsx": "Debug panel showing timing events during initial load with live updates and total duration.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout providing navigation, header, user menu, and logout handling.",
  "frontend/src/components/layout/RouteLoadingFallback.tsx": "Simple centered loading spinner used as a route-level fallback.",
  "frontend/src/components/progress/ProgressCharts.tsx": "Renders weight and body measurement line charts from client progress data or shows an empty state.",
  "frontend/src/components/progress/ProgressEntryForm.tsx": "Form component for entering body measurements and submitting them via useAddProgress, with validation and reset logic.",
  "frontend/src/components/progress/ProgressHistoryTable.tsx": "Displays a sortable table of progress entries with trends and formatted measurements.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useActorReady.ts": "Provides an actorReady flag to delay queries until actor initialization stabilizes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, loading, login, logout, and exposes identity context.",
  "frontend/src/hooks/useQueries.ts": "Collection of typed data-fetching and mutation hooks using react-query, handling actor readiness and caching logic.",
  "frontend/src/hooks/useRouter.ts": "Simple hash-based router hook with navigation and clientCode parsing.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, themes, and base styling rules.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/ClientProfilePage.tsx": "Displays a detailed client profile, handles activation, pause, renewal, expiration, progress tracking, and lazy‑loaded charts/export dialogs.",
  "frontend/src/pages/ClientsListPage.tsx": "Lists all clients with filtering, searching, and export preparation using lazy‑loaded export dialog.",
  "frontend/src/pages/DashboardPage.tsx": "Shows high‑level client metrics, expiring clients, and monthly renewal opportunities with a dialog.",
  "frontend/src/pages/OnboardClientPage.tsx": "Handles creating a new client with onboarding state selection and success screen navigation.",
  "frontend/src/utils/clientCode.ts": "Provides utilities for formatting client codes and matching them against search queries.",
  "frontend/src/utils/clientExportFields.ts": "Defines fields and accessors used when exporting client data, including subscription and progress info.",
  "frontend/src/utils/errors.ts": "Converts backend errors into user‑friendly messages with specific normalization rules.",
  "frontend/src/utils/excelExport.ts": "Exports client data to an Excel file using SheetJS, building headers, rows, and autosized columns before triggering a download.",
  "frontend/src/utils/followUp.ts": "Provides functions to determine follow‑up due dates, check history for today, and compute latest follow‑up status for a client.",
  "frontend/src/utils/format.ts": "Formats timestamps into human‑readable dates, date‑times, or Excel‑friendly YYYY‑MM‑DD strings.",
  "frontend/src/utils/initialLoadTimings.ts": "Lightweight timing tracker that records labeled performance events and outputs a consolidated console report for initial load.",
  "frontend/src/utils/plan.ts": "Computes total plan days, calculates plan end dates, and formats dates for input fields.",
  "frontend/src/utils/renewalOpportunities.ts": "Calculates current‑month boundaries and filters/counts clients whose subscription ends this month and are currently active.",
  "frontend/src/utils/status.ts": "Determines client activation and status, computes display status including expiring states, and aggregates client status metrics.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters, supporting both query strings and hash‑based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, typography, animations, and plugin setup.",
  "project_state.json": "Project metadata describing current state, known issues, and existing performance‑related feature requirements."
}