{
  "backend/main.mo": "Defines the backend canister with authorization, user profiles, and extensive client data structures including progress, pause history, follow‑ups, and comparison helpers.",
  "backend/migration.mo": "Handles upgrading old client records by adding an empty follow‑up history field while preserving all other actor state.",
  "feature_evidence.json": "Lists implemented frontend features related to follow‑up sections, prompts, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides human‑written summaries of all major frontend files for reference or build tooling.",
  "frontend/index.css": "Defines Tailwind base styles and theme variables for light and dark modes using an OKLCH color system.",
  "frontend/index.html": "HTML entry point mounting the React app and loading the main script.",
  "frontend/src/App.tsx": "Main React app controlling authentication, profile setup, routing, and global providers.",
  "frontend/src/components/auth/LoginGate.tsx": "Displays the login screen using Internet Identity with branding and feature highlights.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for first‑time users to submit their name and create a profile.",
  "frontend/src/components/clients/ActivateClientDialog.tsx": "Modal for activating a client plan by selecting a start date and follow‑up day with validation.",
  "frontend/src/components/clients/ClientStatusBadge.tsx": "Renders a status badge based on client onboarding or plan state.",
  "frontend/src/components/clients/FollowUpPromptDialog.tsx": "Dialog prompting whether a follow‑up is done, allowing optional notes and submission.",
  "frontend/src/components/clients/FollowUpSection.tsx": "Displays a client’s follow‑up status and a sortable history table of past entries.",
  "frontend/src/components/clients/PauseClientDialog.tsx": "Dialog for pausing a client plan by entering duration and reason with input validation.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout providing navigation, user menu, and logout handling.",
  "frontend/src/components/progress/ProgressCharts.tsx": "Renders weight and body measurement line charts based on client progress data.",
  "frontend/src/components/progress/ProgressEntryForm.tsx": "Form component allowing users to input and submit body measurements, calling a mutation to save progress and resetting fields on success.",
  "frontend/src/components/progress/ProgressHistoryTable.tsx": "Displays a sortable table of progress entries with trends for weight and formatted measurement values.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity restoration, and identity state management.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching and mutating user profiles and client data through the backend actor.",
  "frontend/src/hooks/useRouter.ts": "Implements simple hash-based routing with helpers to navigate and extract a client code from the current route.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and renders the root component.",
  "frontend/src/pages/ClientProfilePage.tsx": "Renders an individual client profile page with status controls, progress tracking, follow-up prompts, and activation/pause actions.",
  "frontend/src/pages/ClientsListPage.tsx": "Displays a searchable, filterable list of all clients with status badges and navigation to individual profiles.",
  "frontend/src/pages/DashboardPage.tsx": "Shows client metrics, follow-up lists by weekday, and navigation tools for management overview.",
  "frontend/src/pages/OnboardClientPage.tsx": "Provides a form to create new clients, compute plan duration, submit onboarding data, and show success confirmation.",
  "frontend/src/utils/clientCode.ts": "Utilities for formatting client codes and matching search queries against normalized code values.",
  "frontend/src/utils/errors.ts": "Normalizes various backend error shapes into short user-friendly messages.",
  "frontend/src/utils/followUp.ts": "Implements logic for determining follow-up due status, checking daily entries, and retrieving latest follow-up info.",
  "frontend/src/utils/format.ts": "Formats bigint timestamps into readable date and datetime strings.",
  "frontend/src/utils/plan.ts": "Computes total plan days, plan end dates, and formats dates for input fields.",
  "frontend/src/utils/status.ts": "Provides utilities to determine client activation and status, generate display status, and compute counts of active, paused, and expired clients.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, retrieving, and clearing URL and sessionStorage parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining themes, colors, typography, animations, and plugin setup.",
  "project_state.json": "JSON describing project state, existing features, and new feature requests related to client follow‑up status and notes tracking."
}