{
  "kind": "build_request",
  "title": "Investigate and fix persistent slow backend connection by stabilizing readiness polling and query refetch behavior",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the frontend backend-readiness polling so it does not continuously reset and re-poll due to state changes, and so it performs bounded exponential backoff until readiness is confirmed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-4"
        ],
        "quotes": [
          "network is good cross check the codes"
        ]
      },
      "acceptanceCriteria": [
        "When authenticated, the app should not stay stuck on the \"Connecting... / Establishing connection to backend\" screen indefinitely under normal conditions.",
        "The readiness check must not reset its internal retry counter on every retry attempt (i.e., retry scheduling should not cause the effect to restart and reinitialize state).",
        "After readiness becomes true once, subsequent renders/navigation must not trigger repeated readiness polling unless identity/actor truly changes.",
        "Readiness polling must clean up timers correctly to avoid multiple concurrent polling loops."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Reduce unnecessary query invalidation/refetch storms when the actor is created/changes, to avoid repeated backend calls that can make the app feel like it is re-connecting on every interaction.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-2",
          "recent-messages-user-4"
        ],
        "quotes": [
          "got slow again taking much time to establish connection to backend",
          "network is good cross check the codes"
        ]
      },
      "acceptanceCriteria": [
        "Actor creation should not immediately trigger a refetch of all non-actor queries multiple times in quick succession.",
        "React Query caches should remain stable across normal navigation; backend calls should be driven by enabled queries becoming active, not by unconditional global refetches.",
        "Manual testing: after initial load, clicking around dashboard/clients/client pages should not repeatedly show the global connecting screen or cause repeated initial-data fetch patterns without an identity change."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add explicit client-side performance instrumentation for actor creation and backend readiness (isReady) so slow connection setup can be diagnosed from the browser when the debug flag is enabled.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-2",
          "recent-messages-user-4"
        ],
        "quotes": [
          "got slow again taking much time to establish connection to backend",
          "network is good cross check the codes"
        ]
      },
      "acceptanceCriteria": [
        "When the URL contains the existing debug flag, the app records timing events for: actor creation, readiness polling duration (time until first successful isReady), and app init data fetch.",
        "The timing report is visible via the existing debug panel and/or console report without requiring code edits to enable it.",
        "Instrumentation does not change user-facing behavior when debug is not enabled."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useActor.ts in ways that break Internet Identity authentication; keep the existing auth flow intact.",
    "Backend must remain single-actor in backend/main.mo; only add backend changes if strictly required for readiness/performance diagnostics."
  ],
  "nonGoals": [
    "Do not add new third-party monitoring/analytics services.",
    "Do not implement real-time features (WebSockets) or external databases.",
    "Do not change product features unrelated to connection/performance (e.g., client management, follow-ups) beyond what is needed to diagnose/fix the slowness."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}