{
  "kind": "build_request",
  "title": "Add manual 'Mark follow-up done' button in Follow-up Status",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a manual action button in the Client Profile page’s Follow-up Status UI that lets the user mark the follow-up as done on demand (without waiting for the automatic due-date popup).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Add on button in followup status that can manually mark followup done"
        ]
      },
      "acceptanceCriteria": [
        "When viewing an activated client with a configured follow-up day, the Follow-up Status card shows a clear action button to manually mark the follow-up as done.",
        "Clicking the button records a follow-up entry with status = done for that client (using the existing follow-up recording flow), and the UI updates to show the status as Done.",
        "After marking as done, the new entry appears at the top of the Follow-up History table with the current timestamp and correct follow-up day.",
        "The button is disabled and shows a loading state while the follow-up record mutation is in progress.",
        "If recording fails, show a user-facing error toast using the app’s existing error normalization/toast patterns."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or other frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "Keep all backend logic within the single Motoko actor (backend/main.mo); do not introduce additional backend services."
  ],
  "nonGoals": [
    "Do not change the backend FollowUpEntry schema or create new backend APIs if the existing recordFollowUp endpoint supports the manual action.",
    "Do not change the automatic follow-up due popup behavior beyond ensuring it can coexist with the new manual button."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}