{
  "kind": "build_request",
  "title": "Enable dark mode + bold visual theme (colors, headings, layout)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add an in-app dark mode capability that users can toggle at runtime, and ensure the entire UI correctly switches between light and dark themes using class-based dark mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Enable the dark mode of the page"
        ]
      },
      "acceptanceCriteria": [
        "A theme toggle control is available in the authenticated app UI (e.g., header user menu) with options at minimum: Light, Dark, and System.",
        "Toggling theme updates the document theme class (via the existing next-themes ThemeProvider usage) and immediately updates colors across pages (Login, Dashboard, Clients, Onboard, Client Profile).",
        "Theme selection persists across refresh (next-themes persistence).",
        "No changes are made to any files listed under frontend immutablePaths."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the global color palette tokens for both light and dark modes to use a more vivid, bold, and high-contrast scheme (while keeping text readable and accessible) and apply it consistently across the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "give some good bold colors"
        ]
      },
      "acceptanceCriteria": [
        "Global theme variables are updated (in the active global Tailwind theme CSS) so that primary/secondary/accent/muted/border/ring and chart colors look noticeably bolder in both light and dark mode.",
        "Primary actions (buttons/active nav states), key highlights (badges/metrics), and hover states visibly reflect the updated palette without reducing legibility.",
        "Dark mode background is a deep neutral (near-black/charcoal) with clear separation between background, card, and popover surfaces.",
        "No hard-coded colors are introduced in page components where semantic tokens (bg-background, text-foreground, bg-card, text-muted-foreground, text-primary, bg-accent, etc.) can be used instead."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve typography hierarchy by making page titles and section headings more prominent (bold, consistent sizing, spacing, and tracking) and ensure a cohesive layout rhythm across the main pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "headings to titles and good layout that is appealing to eyes"
        ]
      },
      "acceptanceCriteria": [
        "Page titles (e.g., \"Dashboard\", \"Clients\") render with a consistent, strong hierarchy (size/weight/tracking) across pages.",
        "Section headings inside cards/dialogs/forms also follow a consistent heading scale (e.g., h2/h3 styles) with appropriate spacing.",
        "Global base styles include sensible defaults for h1–h4 (or a shared utility pattern) so headings look consistent without repetitive per-page styling.",
        "Key screens (DashboardPage, ClientsListPage, LoginGate, AppLayout header/footer) have improved spacing and alignment for an overall cleaner, more visually appealing layout without changing app functionality."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Apply one coherent visual theme direction across the app (colors, typography, surfaces, and interactive states) that looks modern and “bold” while remaining professional for a CRM/fitness-coaching context.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Lets work on theme",
          "good layout that is appealing to eyes"
        ]
      },
      "acceptanceCriteria": [
        "The UI uses a consistent theme style across header, navigation, cards, dialogs, tables, and empty states (no mixed styling patterns).",
        "Theme direction avoids generic default styling by using clear surface elevation (subtle shadows/borders), purposeful accent usage, and consistent rounding.",
        "The chosen theme does not rely on a blue/purple primary palette (unless already present and explicitly kept); it should look distinct and intentional.",
        "No backend changes are required for the theme update."
      ]
    }
  ],
  "constraints": [
    "Frontend must remain React + TypeScript + Tailwind + shadcn UI + React Query.",
    "Do not edit any files under frontend immutablePaths (compose existing UI components instead).",
    "Backend remains single-actor; no backend changes are needed for theming."
  ],
  "nonGoals": [
    "Adding new application features (CRM logic, new pages, new data models, exports changes).",
    "Introducing third-party theming libraries beyond the already-present next-themes integration.",
    "Reworking authentication or backend connection logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}