{
  "kind": "build_request",
  "title": "Stabilize onboarding flow to prevent “Actor not available” errors",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Prevent the Onboard Client flow from submitting any backend mutations until the backend actor is fully ready, so onboarding never surfaces the raw error text \"Actor not available\" during normal loading/upgrade windows.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "\" Actor not available \" Showing this error  while onboarding the client stabilize the loading so this error doesn’t appear again"
        ]
      },
      "acceptanceCriteria": [
        "On Onboard Client page, the \"Create Client\" action is disabled (and cannot submit via Enter) until the backend actor is ready.",
        "While waiting for actor readiness, the page shows a clear loading/disabled state (English text) indicating the app is connecting/initializing.",
        "Attempting to onboard during an actor-not-ready window does not show a toast or inline message containing the literal text \"Actor not available\".",
        "Once the actor becomes ready, the form becomes usable automatically without requiring a manual refresh."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the onboarding page UI to handle actor readiness explicitly: show a stable, non-flickering loading experience and avoid transient enable/disable states while the actor is being created/invalidated.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "stabilize the loading so this error doesn’t appear again"
        ]
      },
      "acceptanceCriteria": [
        "Onboard Client page does not rapidly toggle between enabled and disabled states when the actor changes (e.g., after login, refresh, or canister upgrade).",
        "Loading indicator and copy are in English and do not expose internal technical terms like \"actor\" to the end user (e.g., prefer \"Connecting…\" / \"Preparing the app…\")."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Harden error normalization so that if an actor-not-ready error still occurs (edge cases), the user-facing message is friendly English and does not display \"Actor not available\" verbatim.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "\" Actor not available \" Showing this error"
        ]
      },
      "acceptanceCriteria": [
        "If a thrown error message includes \"Actor not available\", the displayed message is replaced with a user-friendly English message (e.g., \"The app is still starting up. Please try again in a few seconds.\").",
        "No user-facing toast or inline error in the onboarding flow displays the literal string \"Actor not available\"."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend immutablePaths (including frontend/src/hooks/useActor.ts and Internet Identity hooks).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add new authentication providers (Internet Identity remains the only auth).",
    "Do not introduce new backend services or databases.",
    "Do not change backend canister interfaces unless strictly required to achieve the loading stabilization."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}