{
  "kind": "build_request",
  "title": "Show plan subscription details in client onboarding and isolate data per logged-in user",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a plan subscription section to the client onboarding flow so the coach can record which plan the client purchased and how many extra days were added, and make these values visible on the onboarding review step and after client creation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Plan subscription section missing during client onboarding.",
          "Cannot see which plan the client purchased and the extra days added."
        ]
      },
      "acceptanceCriteria": [
        "The onboarding wizard includes input controls for plan duration (in days or months) and extra days, with clear English labels.",
        "The Review & Confirm step displays the selected plan duration and extra days.",
        "After successfully creating the client, the success screen or next navigation (e.g., Client Profile) allows the coach to see the recorded plan duration and extra days for that client while they are still in onboarding (not yet activated)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Persist the onboarding-time plan details (plan duration and extra days) for each client in the backend data model, and return these details in the APIs used by onboarding client lists and client detail views.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Cannot see which plan the client purchased and the extra days added."
        ]
      },
      "acceptanceCriteria": [
        "When a client is created via the onboarding flow, the backend stores the selected plan duration and extra days with that client record (even if the client has no active subscription yet).",
        "APIs that power onboarding lists and single-client fetches return the stored plan duration and extra days for non-activated (onboarding) clients.",
        "Existing subscription behavior for activated clients remains unchanged (subscriptions history still works as-is)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix user data isolation so that client data and related records are separated per authenticated user (Internet Identity principal), and logging in with different accounts does not show the same client data.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Data not separated for different users; logging in with different Gmail IDs shows the same data."
        ]
      },
      "acceptanceCriteria": [
        "All create/update/query operations for clients only read/write data belonging to the calling principal.",
        "If User A creates clients, User B (different principal) cannot see or access those clients via list queries or direct lookups by client code.",
        "Client codes do not collide across users (either scoped per user or made globally unique in a way that still prevents cross-user access).",
        "The app init / summary endpoints used by the frontend return only the caller’s data."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the frontend data-fetching and list/detail UI to display the recorded onboarding plan duration and extra days for onboarding clients (including in any onboarding client list dialogs and client profile views where appropriate).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Plan subscription section missing during client onboarding.",
          "Cannot see which plan the client purchased and the extra days added."
        ]
      },
      "acceptanceCriteria": [
        "Onboarding client list UI (e.g., dashboard onboarding dialog and/or clients list) shows the onboarding plan duration and extra days for each onboarding client when available.",
        "Client detail/profile UI shows the onboarding plan duration and extra days for non-activated clients, distinct from the activated subscription history table.",
        "All user-facing labels and empty states are in English and remain understandable when plan details are missing."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo only if required for an upgrade of existing stored state.",
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend.immutablePaths (compose existing components instead).",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers (only Internet Identity is in scope).",
    "Adding external databases or off-canister storage.",
    "Real-time syncing or multi-user collaboration features beyond strict per-principal data isolation."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}