{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize backend readiness polling, reduce React Query refetch storms, and add debug timing instrumentation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Stabilize backend readiness polling so retries don't reset on state changes and use bounded exponential backoff with proper timer cleanup.",
      "acceptanceCriteria": [
        "When authenticated, the app should not stay stuck on the \"Connecting... / Establishing connection to backend\" screen indefinitely under normal conditions.",
        "The readiness check must not reset its internal retry counter on every retry attempt (i.e., retry scheduling should not cause the effect to restart and reinitialize state).",
        "After readiness becomes true once, subsequent renders/navigation must not trigger repeated readiness polling unless identity/actor truly changes.",
        "Readiness polling must clean up timers correctly to avoid multiple concurrent polling loops."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBackendReadiness.ts",
          "operation": "modify",
          "description": "Refactor readiness polling to avoid using retryCount as a useEffect dependency (prevent effect restarts). Use refs to track retry attempt count, active timer id, and an in-flight flag; implement bounded exponential backoff (cap delay and cap attempt growth) and ensure a single polling loop per actor instance with robust cleanup on actor/identity change."
        },
        {
          "path": "frontend/src/hooks/useStableActorConnection.ts",
          "operation": "modify",
          "description": "Align connection gating with the updated readiness hook semantics (e.g., ensure connecting/ready transitions are driven solely by the stabilized isChecking/isReady signals and do not re-trigger readiness work)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Prevent global query invalidation/refetch storms on actor creation/changes by relying on enabled queries and stable cache keys instead of unconditional refetching.",
      "acceptanceCriteria": [
        "Actor creation should not immediately trigger a refetch of all non-actor queries multiple times in quick succession.",
        "React Query caches should remain stable across normal navigation; backend calls should be driven by enabled queries becoming active, not by unconditional global refetches.",
        "Manual testing: after initial load, clicking around dashboard/clients/client pages should not repeatedly show the global connecting screen or cause repeated initial-data fetch patterns without an identity change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Replace unconditional invalidateQueries+refetchQueries-on-actor-change behavior with a more targeted approach: only react when the actor instance truly changes (track previous actor in a ref), avoid global refetches, and prefer letting enabled queries fetch naturally when active. Keep the existing Internet Identity flow intact."
        },
        {
          "path": "frontend/src/hooks/useActorReady.ts",
          "operation": "modify",
          "description": "Review and adjust the actorReady timing signal (if needed) to ensure actor transitions don't cause query thrash (e.g., avoid repeated toggling during actor recreation) while preserving the intent of preventing queries from mounting during actor-change windows."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add debug-only client-side performance instrumentation for actor creation, backend readiness polling duration, and app init fetch timing, visible in the existing debug panel and/or console.",
      "acceptanceCriteria": [
        "When the URL contains the existing debug flag, the app records timing events for: actor creation, readiness polling duration (time until first successful isReady), and app init data fetch.",
        "The timing report is visible via the existing debug panel and/or console report without requiring code edits to enable it.",
        "Instrumentation does not change user-facing behavior when debug is not enabled."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/initialLoadTimings.ts",
          "operation": "modify",
          "description": "Adjust the timing utility so it is gated by the existing debug flag (no console output and minimal overhead when debug is disabled). Ensure reporting does not permanently freeze timing collection (allow actor creation/readiness events even if an initial report already occurred)."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Add debug-only timing marks for actor creation (e.g., start before createActorWithConfig and end after access-control initialization completes) using the existing timings utility, without altering the authentication behavior."
        },
        {
          "path": "frontend/src/hooks/useBackendReadiness.ts",
          "operation": "modify",
          "description": "Add debug-only timing marks for backend readiness polling duration (start when polling begins for a new actor; end on the first successful readiness confirmation). Ensure retries do not create multiple overlapping timing events."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure app init fetch timing is recorded under the debug flag (keep/standardize the existing 'app-init-data-fetch' event), and ensure reporting is invoked in a way that keeps the debug panel updated while avoiding unintended console output when debug is disabled."
        },
        {
          "path": "frontend/src/components/debug/InitialLoadDebugPanel.tsx",
          "operation": "modify",
          "description": "Update the debug panel (without editing any files under frontend/src/components/ui) to display the added timing labels clearly (actor creation and backend readiness) and ensure it remains driven by the existing debug flag."
        }
      ]
    }
  ]
}