{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add onboarding plan subscription details to onboarding flow and display across onboarding lists and profiles",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add plan subscription inputs (plan duration and extra days) into the onboarding wizard, show them on the Review step, and keep them visible after client creation while still onboarding.",
      "acceptanceCriteria": [
        "The onboarding wizard includes input controls for plan duration (in days or months) and extra days, with clear English labels.",
        "The Review & Confirm step displays the selected plan duration and extra days.",
        "After successfully creating the client, the success screen or next navigation (e.g., Client Profile) allows the coach to see the recorded plan duration and extra days for that client while they are still in onboarding (not yet activated)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/OnboardClientPage.tsx",
          "operation": "modify",
          "description": "Extend the onboarding form state to capture plan duration (value + unit: days/months) and extra days; add a new “Plan Subscription” section to the wizard flow (either as a dedicated step or within the existing step structure), render clear English-labeled inputs, validate numeric inputs, include the values in the Review & Confirm UI, and show the recorded values on the post-create success screen alongside the created client code."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the create-client mutation hook to accept onboarding-time plan details and pass them through the existing createClient backend call (planDurationDays and extraDays), and ensure relevant queries are invalidated so the newly created client’s plan details appear immediately in subsequent onboarding/client views."
        },
        {
          "path": "frontend/src/components/onboarding/PlanSubscriptionSection.tsx",
          "operation": "create",
          "description": "Create a reusable onboarding UI section component to collect plan duration (days/months) and extra days using existing composed UI primitives (do not edit files under frontend/src/components/ui)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Display onboarding plan duration and extra days across onboarding client lists and client profile views for non-activated clients with clear English labels and sensible empty states.",
      "acceptanceCriteria": [
        "Onboarding client list UI (e.g., dashboard onboarding dialog and/or clients list) shows the onboarding plan duration and extra days for each onboarding client when available.",
        "Client detail/profile UI shows the onboarding plan duration and extra days for non-activated clients, distinct from the activated subscription history table.",
        "All user-facing labels and empty states are in English and remain understandable when plan details are missing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update frontend type definitions to reflect that onboarding client summary/detail payloads can include onboarding-time plan details (e.g., add an optional initialPlanDetails field on ClientSummary if returned by the backend), so UI code can safely render plan duration and extra days."
        },
        {
          "path": "frontend/src/pages/ClientProfilePage.tsx",
          "operation": "modify",
          "description": "Update the Plan Details card to render onboarding-time plan duration and extra days when the client is not activated and has no active subscription yet (use initialPlanDetails when present), clearly distinguishing it from activated subscription information and keeping English placeholders (e.g., “—” / “Not recorded”)."
        },
        {
          "path": "frontend/src/components/dashboard/OnboardingClientsDialog.tsx",
          "operation": "modify",
          "description": "Enhance the onboarding clients table to include columns/rows for onboarding plan duration and extra days (when available) with clear English labels and graceful fallbacks when missing."
        },
        {
          "path": "frontend/src/components/dashboard/ClientsMetricDialog.tsx",
          "operation": "modify",
          "description": "Add optional support to render onboarding plan duration and extra days in metric list tables when the provided client summaries represent non-activated (onboarding) clients, without changing existing activated-client behaviors or labels."
        },
        {
          "path": "frontend/src/pages/ClientsListPage.tsx",
          "operation": "modify",
          "description": "Update the clients list UI to show onboarding plan duration and extra days for non-activated clients (where appropriate in the list item layout), ensuring labels and empty states are in English and remain understandable when plan details are absent."
        },
        {
          "path": "frontend/src/utils/clientExportFields.ts",
          "operation": "modify",
          "description": "Extend exportable fields to include onboarding plan duration (days) and onboarding extra days for non-activated clients when available, with English column labels and safe fallbacks for missing data."
        }
      ]
    }
  ]
}