{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Dark mode toggle + bold, high-contrast CRM theme (colors + typography + layout)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a runtime theme toggle (Light/Dark/System) using class-based dark mode via existing next-themes ThemeProvider.",
      "acceptanceCriteria": [
        "A theme toggle control is available in the authenticated app UI (e.g., header user menu) with options at minimum: Light, Dark, and System.",
        "Toggling theme updates the document theme class (via the existing next-themes ThemeProvider usage) and immediately updates colors across pages (Login, Dashboard, Clients, Onboard, Client Profile).",
        "Theme selection persists across refresh (next-themes persistence).",
        "No changes are made to any files listed under frontend immutablePaths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/theme/ThemeToggleMenu.tsx",
          "operation": "create",
          "description": "Create a small authenticated-UI theme switcher that uses next-themes (useTheme) to set theme to Light/Dark/System and renders as dropdown menu items suitable for placing in the header user menu."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Wire the new ThemeToggleMenu into the authenticated header user dropdown, adding Light/Dark/System options and ensuring the control is discoverable alongside logout."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Confirm ThemeProvider configuration remains class-based (attribute=\"class\") and supports System theme; adjust defaults only if needed to align with Light/Dark/System toggle behavior without changing routing/auth logic."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Refresh global semantic color tokens for a vivid, bold, high-contrast palette across light and dark modes, avoiding hard-coded colors in page components.",
      "acceptanceCriteria": [
        "Global theme variables are updated (in the active global Tailwind theme CSS) so that primary/secondary/accent/muted/border/ring and chart colors look noticeably bolder in both light and dark mode.",
        "Primary actions (buttons/active nav states), key highlights (badges/metrics), and hover states visibly reflect the updated palette without reducing legibility.",
        "Dark mode background is a deep neutral (near-black/charcoal) with clear separation between background, card, and popover surfaces.",
        "No hard-coded colors are introduced in page components where semantic tokens (bg-background, text-foreground, bg-card, text-muted-foreground, text-primary, bg-accent, etc.) can be used instead."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update the OKLCH CSS variables for :root and .dark to a bolder, higher-contrast palette (primary/secondary/accent/muted/border/ring + chart colors) while preserving readability and clear surface separation (background/card/popover)."
        },
        {
          "path": "frontend/src/pages/OnboardClientPage.tsx",
          "operation": "modify",
          "description": "Replace any hard-coded success/brand colors (e.g., green-*) with semantic theme tokens (primary/accent/muted/destructive) so the palette changes apply consistently in both light/dark."
        },
        {
          "path": "frontend/src/components/auth/LoginGate.tsx",
          "operation": "modify",
          "description": "Ensure hero/gradient/illustrative styling relies on semantic tokens (background/accent/primary/muted) and does not introduce new hard-coded colors that bypass the global palette."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Establish a stronger, consistent typography hierarchy (titles/headings) and improve spacing rhythm across key pages and layout.",
      "acceptanceCriteria": [
        "Page titles (e.g., \"Dashboard\", \"Clients\") render with a consistent, strong hierarchy (size/weight/tracking) across pages.",
        "Section headings inside cards/dialogs/forms also follow a consistent heading scale (e.g., h2/h3 styles) with appropriate spacing.",
        "Global base styles include sensible defaults for h1–h4 (or a shared utility pattern) so headings look consistent without repetitive per-page styling.",
        "Key screens (DashboardPage, ClientsListPage, LoginGate, AppLayout header/footer) have improved spacing and alignment for an overall cleaner, more visually appealing layout without changing app functionality."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust global base typography styles for h1–h4 (size/weight/tracking/spacing) and supporting rhythm defaults (e.g., consistent margins for headings) using Tailwind @layer base so pages can rely on shared hierarchy."
        },
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Align page header structure with the global heading hierarchy (use consistent heading elements/classes) and tighten spacing for a cleaner dashboard layout without changing metrics/dialog behavior."
        },
        {
          "path": "frontend/src/pages/ClientsListPage.tsx",
          "operation": "modify",
          "description": "Normalize the page title/subtitle hierarchy and header row spacing (title, actions, search/filter controls) to match the new global typography rhythm without changing filtering/export behavior."
        },
        {
          "path": "frontend/src/pages/OnboardClientPage.tsx",
          "operation": "modify",
          "description": "Apply the consistent page-title/section-heading hierarchy to the onboarding header and review section headings, improving spacing/scanability while preserving the wizard flow and validation logic."
        },
        {
          "path": "frontend/src/pages/ClientProfilePage.tsx",
          "operation": "modify",
          "description": "Apply consistent title/heading hierarchy for the client name header and section card titles; refine spacing between header, summary cards, and tab sections without changing client actions or data rendering."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Refine header/footer layout rhythm (container padding, vertical alignment, nav spacing) to better match the updated typography scale while preserving routes/navigation behavior."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Apply a cohesive modern, bold, professional visual theme across surfaces and interactive states (header/nav/cards/dialogs/tables/empty states) with no backend changes.",
      "acceptanceCriteria": [
        "The UI uses a consistent theme style across header, navigation, cards, dialogs, tables, and empty states (no mixed styling patterns).",
        "Theme direction avoids generic default styling by using clear surface elevation (subtle shadows/borders), purposeful accent usage, and consistent rounding.",
        "The chosen theme does not rely on a blue/purple primary palette (unless already present and explicitly kept); it should look distinct and intentional.",
        "No backend changes are required for the theme update."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust global base styles to reinforce a consistent surface system (background/card/popover separation), interactive focus/hover affordances via semantic tokens, and consistent rounding/elevation cues aligned with the updated palette."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Unify header/nav styling patterns (active vs inactive states, surface translucency, borders/shadows) and ensure all styling continues to use semantic tokens for both light/dark modes."
        },
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Ensure metric cards and hover states consistently reflect the new bold theme direction (semantic accents, subtle elevation) without introducing hard-coded colors or altering behavior."
        },
        {
          "path": "frontend/src/pages/ClientsListPage.tsx",
          "operation": "modify",
          "description": "Ensure list cards and empty states match the same surface/elevation/hover treatment used elsewhere, relying on semantic tokens and consistent rounding."
        },
        {
          "path": "frontend/src/pages/ClientProfilePage.tsx",
          "operation": "modify",
          "description": "Ensure section cards, tabs, and dialogs align with the unified theme direction (surfaces, borders, interactive states) while keeping all existing client-management functionality intact."
        },
        {
          "path": "frontend/src/components/auth/LoginGate.tsx",
          "operation": "modify",
          "description": "Bring the unauthenticated login screen styling (hero surface, emphasis, spacing) in line with the cohesive bold theme using the shared token system."
        }
      ]
    }
  ]
}