{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize onboarding flow during backend initialization to avoid raw actor errors",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Gate Onboard Client submission until the backend connection is ready and prevent any submission attempts (including Enter key) during initialization windows.",
      "acceptanceCriteria": [
        "On Onboard Client page, the \"Create Client\" action is disabled (and cannot submit via Enter) until the backend actor is ready.",
        "While waiting for actor readiness, the page shows a clear loading/disabled state (English text) indicating the app is connecting/initializing.",
        "Attempting to onboard during an actor-not-ready window does not show a toast or inline message containing the literal text \"Actor not available\".",
        "Once the actor becomes ready, the form becomes usable automatically without requiring a manual refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/OnboardClientPage.tsx",
          "operation": "modify",
          "description": "Use actor readiness to hard-disable all onboarding mutations until ready: derive a single boolean for \"canInteract\" (based on stable readiness), disable the submit button and form fields accordingly, and add a guard at the top of handleSubmit to no-op when not ready (preventing mutation calls). Add keyboard handling so pressing Enter cannot submit while disabled (e.g., preventDefault in onKeyDown when not interactable). Ensure the loading/disabled copy is English and does not include internal terms like \"actor\"."
        },
        {
          "path": "frontend/src/hooks/useStableActorConnection.ts",
          "operation": "create",
          "description": "Create a small wrapper hook around the existing useActorReady that exposes a stabilized connection state for UI gating (e.g., introduces a short minimum loading duration and/or a debounce to avoid rapid toggling when actor is created/invalidated). Use this hook from the onboarding page to decide disabled/loading state."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make onboarding readiness UI stable and non-flickering while backend connection state changes, showing a consistent connecting experience without exposing technical terms.",
      "acceptanceCriteria": [
        "Onboard Client page does not rapidly toggle between enabled and disabled states when the actor changes (e.g., after login, refresh, or canister upgrade).",
        "Loading indicator and copy are in English and do not expose internal technical terms like \"actor\" to the end user (e.g., prefer \"Connecting…\" / \"Preparing the app…\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useStableActorConnection.ts",
          "operation": "modify",
          "description": "Implement stabilization logic for connection readiness (debounce/hysteresis) so transient actor invalidation windows don't cause rapid UI state flips. Provide a simple API (e.g., { isConnecting, isReady }) that the onboarding page can consume for consistent rendering."
        },
        {
          "path": "frontend/src/pages/OnboardClientPage.tsx",
          "operation": "modify",
          "description": "Render a stable connecting/initializing state driven by the stabilized readiness hook: show a non-flickering loader + English copy (e.g., \"Connecting…\" / \"Preparing the app…\") and keep the form controls disabled until the ready signal is stable. Avoid flashing between enabled/disabled by relying only on the stabilized state for UI."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Normalize actor-not-ready errors into friendly English and ensure the onboarding flow never displays the literal \"Actor not available\" message.",
      "acceptanceCriteria": [
        "If a thrown error message includes \"Actor not available\", the displayed message is replaced with a user-friendly English message (e.g., \"The app is still starting up. Please try again in a few seconds.\").",
        "No user-facing toast or inline error in the onboarding flow displays the literal string \"Actor not available\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/errors.ts",
          "operation": "modify",
          "description": "Extend normalizeError to explicitly detect actor-not-ready conditions (including message containing \"Actor not available\") and replace them with a friendly English startup message. Ensure the returned message never contains the literal substring \"Actor not available\"."
        },
        {
          "path": "frontend/src/pages/OnboardClientPage.tsx",
          "operation": "modify",
          "description": "Ensure onboarding error surfaces only normalized messages: keep using normalizeError for toasts, and avoid emitting any toast/inline error when the form is disabled due to connecting state (so edge-case submission attempts cannot leak raw errors)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Prevent raw technical errors from being displayed in the global init error UI by replacing the direct error.message rendering with normalizeError(error) (still logging raw error to console). This reduces the chance of \"Actor not available\" being shown anywhere user-facing during initialization windows."
        }
      ]
    }
  ]
}