{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "New project",
  "architectural_notes": [],
  "known_issues": [
    "Plan subscription section missing during client onboarding (cannot see purchased plan and extra days).",
    "User data not separated across accounts: logging in with different Gmail IDs shows the same data."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-add-a-plan-subscription-section-to-the-client-onboarding-flow-so-the-coach-can-record-which-plan-the-client-purchased-and-how-many-extra-days-were-added-and-make-these-values-visible-on-the-onboarding-review-step-and-after-client-creation",
      "title": "Add a plan subscription section to the client onboarding flow so the coach can record which plan the client purchased and how many extra days were added, and make these values visible on the onboarding review step and after client creation.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-frontend-data-fetching-and-list-detail-ui-to-display-the-recorded-onboarding-plan-duration-and-extra-days-for-onboarding-clients-including-in-any-onboarding-client-list-dialogs-and-client-profile-views-where-appropriate",
      "title": "Update the frontend data-fetching and list/detail UI to display the recorded onboarding plan duration and extra days for onboarding clients (including in any onboarding client list dialogs and client profile views where appropriate).",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Show plan subscription details during client onboarding (plan purchased and extra days added)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Fix user data isolation issue: different Gmail logins currently see the same data",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Persist the onboarding-time plan details (plan duration and extra days) for each client in the backend data model, and return these details in the APIs used by onboarding client lists and client detail views.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Fix user data isolation so that client data and related records are separated per authenticated user (Internet Identity principal), and logging in with different accounts does not show the same client data.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Show plan subscription details in client onboarding and isolate data per logged-in user",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}