{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-14T20:58:56.169Z",
  "summary": "Diff implements new frontend summary-based queries and updates Dashboard/Clients list to use them, plus status utilities to support both summary and full client types. However, the backend changes shown do not provide clear evidence of the required new ClientSummary type and summary query APIs, and the startup refetch-storm fix in useActor.ts is not evidenced. There are also unrelated feature changes (user profiles and onboarding UX) not requested.",
  "missing_requirements": [
    {
      "id": "REQ-1",
      "requirement": "Backend defines a new public lightweight ClientSummary type excluding progress/pauseEntries/followUpHistory, and exposes a new query method returning all client summaries in one call with access rules consistent with existing APIs, while keeping existing endpoints unchanged.",
      "reason": "Frontend now calls summary endpoints (getActivatedClientSummaries/getNonActivatedClientSummaries) and imports ClientSummary, but the provided backend diff snippet is truncated and does not show a public ClientSummary type or the required query method(s). The new endpoints are not visible in the backend evidence provided.",
      "evidence": [
        "backend/main.mo (truncated)",
        "frontend/src/hooks/useQueries.ts (calls actor.getActivatedClientSummaries() / actor.getNonActivatedClientSummaries())"
      ]
    },
    {
      "id": "REQ-2",
      "requirement": "React Query caches for summaries and full clients are kept consistent (mutations that change client fields invalidate/refetch the summary list cache as needed).",
      "reason": "While new summary hooks and page usage are present, the diff excerpt does not show mutations (e.g., activate/pause/edit client) invalidating/refetching the ['clientSummaries', identityKey] cache. Only the user profile mutation shows invalidation for ['currentUserProfile', identityKey].",
      "evidence": [
        "frontend/src/hooks/useQueries.ts (shows invalidateQueries only for currentUserProfile; summary cache invalidation not evidenced in truncated content)"
      ]
    },
    {
      "id": "REQ-3",
      "requirement": "Remove any unconditional broad refetch-all behavior tied to actor creation/identity changes (frontend/src/hooks/useActor.ts should not refetch all non-actor queries when actor becomes available).",
      "reason": "No change to frontend/src/hooks/useActor.ts is shown in the diff summary (it is not listed among modified files), so there is no evidence the refetch-storm behavior was removed or narrowed.",
      "evidence": [
        "File diff summary: no entry for frontend/src/hooks/useActor.ts"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Added backend user profile APIs (UserProfile type plus getCallerUserProfile/getUserProfile/saveCallerUserProfile) unrelated to client-summary fetching performance requirements.",
      "reason": "BuildRequest does not ask for user profiles or profile persistence endpoints; these appear as new/changed backend functionality beyond the specified scope.",
      "evidence": [
        "backend/main.mo (truncated: UserProfile type and related methods)"
      ]
    },
    {
      "description": "Changed onboarding UX: removed follow-up day selection on OnboardClientPage and added a note about activation being required to set follow-up day.",
      "reason": "BuildRequest explicitly focuses on load-time/data-fetch performance and states non-goals include unrelated product features/UI redesign; this is a behavioral/UX change not requested.",
      "evidence": [
        "frontend-file-summaries.txt (OnboardClientPage: follow-up day selection removed and note added)"
      ]
    }
  ],
  "confidence": 0.68,
  "changed_files": [
    "backend/main.mo",
    "frontend-file-summaries.txt",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/pages/ClientsListPage.tsx",
    "frontend/src/pages/DashboardPage.tsx",
    "frontend/src/utils/status.ts",
    "project_state.json"
  ]
}