{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-14T19:50:11.892Z",
  "summary": "Diff adds a manual \"Mark as Done\" button UI to the Follow-up Status card with a disabled/loading state, but the diff excerpts do not provide enough evidence that the button is only shown for activated clients with a configured follow-up day, that clicking it actually records a done follow-up via the existing flow and updates the UI/history, or that failures surface a normalized error toast.",
  "missing_requirements": [
    {
      "id": "REQ-1",
      "requirement": "When viewing an activated client with a configured follow-up day, the Follow-up Status card shows a clear action button to manually mark the follow-up as done.",
      "reason": "FollowUpSection renders the button whenever an onMarkDone prop is provided, but the provided diff snippet does not show the parent logic that only supplies onMarkDone for activated clients with a configured follow-up day.",
      "evidence": [
        "frontend/src/components/clients/FollowUpSection.tsx (button gated only by `onMarkDone`)",
        "frontend/src/pages/ClientProfilePage.tsx (truncated; parent gating logic not visible)"
      ]
    },
    {
      "id": "REQ-1",
      "requirement": "Clicking the button records a follow-up entry with status = done for that client using the existing follow-up recording flow, and the UI updates to show the status as Done.",
      "reason": "ClientProfilePage imports useRecordFollowUp, toast, and normalizeError, but the actual onClick handler implementation (calling the mutation and updating UI state/cache) is not visible in the truncated excerpt.",
      "evidence": [
        "frontend/src/pages/ClientProfilePage.tsx (truncated; imports `useRecordFollowUp`, `toast`, `normalizeError` but handler not shown)"
      ]
    },
    {
      "id": "REQ-1",
      "requirement": "After marking as done, the new entry appears at the top of the Follow-up History table with the current timestamp and correct follow-up day.",
      "reason": "FollowUpSection sorts history by timestamp descending (which would display a newly added entry at the top), but the diff excerpt does not show that a new entry is actually appended/returned from the existing record flow with correct timestamp and follow-up day.",
      "evidence": [
        "frontend/src/components/clients/FollowUpSection.tsx (history is sorted by timestamp desc)",
        "frontend/src/pages/ClientProfilePage.tsx (truncated; mutation success/update not shown)"
      ]
    },
    {
      "id": "REQ-1",
      "requirement": "If recording fails, show a user-facing error toast using the app’s existing error normalization/toast patterns.",
      "reason": "Although toast and normalizeError are imported in ClientProfilePage, the diff excerpt is truncated before any error handling for the manual mark-done action is shown.",
      "evidence": [
        "frontend/src/pages/ClientProfilePage.tsx (truncated; imports `normalizeError` and `toast` but error handling not shown)"
      ]
    }
  ],
  "hallucinated_features": [],
  "confidence": 0.56,
  "changed_files": [
    "frontend-file-summaries.txt",
    "frontend/src/components/clients/FollowUpSection.tsx",
    "frontend/src/pages/ClientProfilePage.tsx",
    "project_state.json"
  ]
}